<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png">

In [ ]:
'''
What is Pandas?
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

Why Use Pandas?
Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.


Pandas : Powerful for data analysis

Pandas stands for “Python Data Analysis Library”

one of the most preferred and widely used tools in Data munging / Wrangling


Data wrangling —also called data cleaning, data remediation, 
or data munging —refers to a variety of processes designed to transform raw data into more readily used formats

'''


<img src="https://static.javatpoint.com/tutorial/pandas/images/python-pandas-dataframe.png">

In [1]:
#!pip install pandas
import pandas as pd
import numpy as np

In [2]:
'''
What is a Series?
A Pandas Series is like a column in a table.

It is a one-dimensional array holding data of any type.
'''
s1 = pd.Series([23,24,25,12,32])
s1

0    23
1    24
2    25
3    12
4    32
dtype: int64

<img src="https://1.bp.blogspot.com/-AkAiqQBMhvM/XJiYR2xWg-I/AAAAAAAAAIo/wXoFEgnKbhQbpEy_o5XxAYY5uA0y97hOQCLcBGAs/w1200-h630-p-k-no-nu/pandas-powerful-data-analysis-tools-for-python-13-638.jpg">

In [3]:
s2 = pd.Series([23,45,67,12,34],index = ['a','b','c','d','e'])
s2

a    23
b    45
c    67
d    12
e    34
dtype: int64

In [4]:
s3 = pd.Series([23,45,67,12,34],index = ['a','b','c','d','e'],dtype = 'float')
s3

a    23.0
b    45.0
c    67.0
d    12.0
e    34.0
dtype: float64

### creation of Series using dictionary

In [5]:
s4 = pd.Series({'e':65,'f':43,'c':45})
s4

e    65
f    43
c    45
dtype: int64

### DataFrame
What is a DataFrame?
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

<img src="https://storage.googleapis.com/lds-media/images/series-and-dataframe.width-1200.png">

In [6]:
d1 = pd.DataFrame([43,54,65,76])
d1

    0
0  43
1  54
2  65
3  76

In [7]:
d2 = pd.DataFrame([[2,3,4],[4,5,6],[1,2,3]])
d2

   0  1  2
0  2  3  4
1  4  5  6
2  1  2  3

In [8]:
d2 = pd.DataFrame(s2)  #converting series into dataframe
d2

    0
a  23
b  45
c  67
d  12
e  34

In [9]:
d3  = pd.DataFrame([[2,3,4],[4,5,6],[1,2,3]],columns =['a','b','c'])
d3

   a  b  c
0  2  3  4
1  4  5  6
2  1  2  3

In [10]:
d3  = pd.DataFrame([[2,3,4],[4,5,6],[1,2,3]],columns =['a','b','c'],index = ['x','y','z'])
d3

   a  b  c
x  2  3  4
y  4  5  6
z  1  2  3

### creating DataFrame from list of dictionaries

In [11]:
dic = [{'alex':1,'joe':2},{'ema':5,'dora':10,'alice':20},{'ema':5,'dora':10,'alice':20}]    
pd.DataFrame(dic,index=['a','b','c'])

   alex  joe  ema  dora  alice
a   1.0  2.0  NaN   NaN    NaN
b   NaN  NaN  5.0  10.0   20.0
c   NaN  NaN  5.0  10.0   20.0

### DataFrame operations

In [12]:
d3

   a  b  c
x  2  3  4
y  4  5  6
z  1  2  3

In [13]:
print(d3['a'])
print(d3['b'])

x    2
y    4
z    1
Name: a, dtype: int64
x    3
y    5
z    2
Name: b, dtype: int64

In [14]:
d3['d']=d3['a']*d3['b']
d3['e']=d3['a']+d3['d']
d3

   a  b  c   d   e
x  2  3  4   6   8
y  4  5  6  20  24
z  1  2  3   2   3

In [15]:
pop = d3.pop('b') 
d3

   a  c   d   e
x  2  4   6   8
y  4  6  20  24
z  1  3   2   3

In [16]:
d3

   a  c   d   e
x  2  4   6   8
y  4  6  20  24
z  1  3   2   3

In [17]:
del d3['d']

In [18]:
d3

   a  c   e
x  2  4   8
y  4  6  24
z  1  3   3

In [19]:
d3.pop('a')
d3

   c   e
x  4   8
y  6  24
z  3   3

In [20]:
d3.insert(1,'new1',d3['c']) #(loc,col,data)
d3

   c  new1   e
x  4     4   8
y  6     6  24
z  3     3   3

In [23]:
d={'c':1,'new1':33,'e':22}
df11=d3.append(d,ignore_index=True)
df11

   c  new1   e
0  4     4   8
1  6     6  24
2  3     3   3
3  1    33  22

In [31]:
import numpy as np
d4 = pd.DataFrame({'abc':np.random.randint(2,6,size=(10)),'bcd':np.random.randint(4,10,size=(10)),'cde':np.random.randint(3,10,size=(10))})
d4

   abc  bcd  cde
0    3    4    3
1    2    6    5
2    5    9    7
3    4    9    8
4    2    4    9
5    2    8    7
6    3    7    8
7    2    6    8
8    2    9    5
9    2    4    3

In [34]:
d4.head()

   abc  bcd  cde
0    3    4    3
1    2    6    5
2    5    9    7
3    4    9    8
4    2    4    9

In [32]:
d4.tail()

   abc  bcd  cde
5    2    8    7
6    3    7    8
7    2    6    8
8    2    9    5
9    2    4    3

In [35]:
'''
Info About the Data
The DataFrames object has a method called info(),that gives you more information about the data set.'''
d4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   abc     10 non-null     int32
 1   bcd     10 non-null     int32
 2   cde     10 non-null     int32
dtypes: int32(3)
memory usage: 248.0 bytes

<img src="https://vrzkj25a871bpq7t1ugcgmn9-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/pandas-loc-get-specific-column-syntax.png">

In [36]:
d4

   abc  bcd  cde
0    3    4    3
1    2    6    5
2    5    9    7
3    4    9    8
4    2    4    9
5    2    8    7
6    3    7    8
7    2    6    8
8    2    9    5
9    2    4    3

In [37]:
d4.loc[9,'cde'] #loc[row name,colname]

3

In [38]:
d4

   abc  bcd  cde
0    3    4    3
1    2    6    5
2    5    9    7
3    4    9    8
4    2    4    9
5    2    8    7
6    3    7    8
7    2    6    8
8    2    9    5
9    2    4    3

In [39]:
d4.loc[4:9,['abc','cde']]

   abc  cde
4    2    9
5    2    7
6    3    8
7    2    8
8    2    5
9    2    3

In [40]:
d4.loc[[3,4,7],['abc','cde']]

   abc  cde
3    4    8
4    2    9
7    2    8

In [ ]:
d4

<img src='https://www.marsja.se/wp-content/uploads/2019/09/pandas_select_row_by_index_iloc.png'>

In [41]:
d4.iloc[9,2]  #[row index,column index]

3

In [42]:
d4.iloc[2:7,[0,2]]

   abc  cde
2    5    7
3    4    8
4    2    9
5    2    7
6    3    8

In [43]:
d4

   abc  bcd  cde
0    3    4    3
1    2    6    5
2    5    9    7
3    4    9    8
4    2    4    9
5    2    8    7
6    3    7    8
7    2    6    8
8    2    9    5
9    2    4    3

In [44]:
d4.abc

0    3
1    2
2    5
3    4
4    2
5    2
6    3
7    2
8    2
9    2
Name: abc, dtype: int32

In [45]:
d4.abc.values # data frame . column .values

array([3, 2, 5, 4, 2, 2, 3, 2, 2, 2])

In [46]:
d4['sub'] = d4.abc.values - d4.cde.values - d4.bcd.values
d4

   abc  bcd  cde  sub
0    3    4    3   -4
1    2    6    5   -9
2    5    9    7  -11
3    4    9    8  -13
4    2    4    9  -11
5    2    8    7  -13
6    3    7    8  -12
7    2    6    8  -12
8    2    9    5  -12
9    2    4    3   -5

In [47]:
a = [['rk',102,15000],['rama',103,20000],['krishna',104,25000]]
dfl = pd.DataFrame(a,columns = ['name','id','salary'])
dfl

      name   id  salary
0       rk  102   15000
1     rama  103   20000
2  krishna  104   25000

In [48]:
y=dfl[dfl.salary>=20000]
print(y)
y[['id','salary']]

      name   id  salary
1     rama  103   20000
2  krishna  104   25000

    id  salary
1  103   20000
2  104   25000

In [49]:
dfl.append({'name' : 'sajan','id' : 105,'salary' : 30000},ignore_index=True)

      name   id  salary
0       rk  102   15000
1     rama  103   20000
2  krishna  104   25000
3    sajan  105   30000

In [50]:
dfl = dfl.append({'name' : np.nan,'id' : 105,'salary' : 30000},ignore_index = True)
dfl

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      NaN  105.0  30000.0

In [51]:
dfl.isnull()

    name     id  salary
0  False  False   False
1  False  False   False
2  False  False   False
3   True  False   False

In [52]:
dfl.isnull().sum()

name      1
id        0
salary    0
dtype: int64

In [53]:
dfl.dropna()

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0

In [54]:
dfl

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      NaN  105.0  30000.0

In [55]:
dfl.fillna(value = 'abc')

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      abc  105.0  30000.0

In [56]:
dfl

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      NaN  105.0  30000.0

In [57]:
dfl.drop([0],axis=0,inplace=True)
dfl

      name     id   salary
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      NaN  105.0  30000.0


### Groupby

<img src="https://th.bing.com/th/id/OIP.h5V2-wp2jL4Ip5FTRd6ThQAAAA?pid=ImgDet&rs=1">

In [58]:
df = pd.DataFrame({'Animal' : ['Falcon', 'Falcon','Parrot', 'Parrot'],'Max Speed' : [380., 370., 24., 26.]})
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [59]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [60]:
import pandas as pd
df_csv = pd.read_csv('data.csv')
df_csv

   Unnamed: 0     COUNTRY      POP      AREA       GDP       CONT     IND_DAY
0         CHN       China  1398.72   9596.96  12234.78       Asia         NaN
1         IND       India  1351.16   3287.26   2575.67       Asia  1947-08-15
2         USA          US   329.74   9833.52  19485.39  N.America  1776-07-04
3         IDN   Indonesia   268.07   1910.93   1015.54       Asia  1945-08-17
4         BRA      Brazil   210.32   8515.77   2055.51  S.America  1822-09-07
5         PAK    Pakistan   205.71    881.91    302.14       Asia  1947-08-14
6         NGA     Nigeria   200.96    923.77    375.77     Africa  1960-10-01
7         BGD  Bangladesh   167.09    147.57    245.63       Asia  1971-03-26
8         RUS      Russia   146.79  17098.25   1530.75        NaN  1992-06-12
9         MEX      Mexico   126.58   1964.38   1158.23  N.America  1810-09-16
10        JPN       Japan   126.22    377.97   4872.42       Asia         NaN
11        DEU     Germany    83.02    357.11   3693.20     Europe         NaN
12        FRA      France    67.02    640.68   2582.49     Europe  1789-07-14
13        GBR          UK    66.44    242.50   2631.23     Europe         NaN
14        ITA       Italy    60.36    301.34   1943.84     Europe         NaN
15        ARG   Argentina    44.94   2780.40    637.49  S.America  1816-07-09
16        DZA     Algeria    43.38   2381.74    167.56     Africa  1962-07-05
17        CAN      Canada    37.59   9984.67   1647.12  N.America  1867-07-01
18        AUS   Australia    25.47   7692.02   1408.68    Oceania         NaN
19        KAZ  Kazakhstan    18.53   2724.90    159.41       Asia  1991-12-16

In [61]:
df_csv.columns
df_csv.isnull().sum()

Unnamed: 0    0
COUNTRY       0
POP           0
AREA          0
GDP           0
CONT          1
IND_DAY       6
dtype: int64

In [62]:
df_csv['COUNTRY'].values

array(['China', 'India', 'US', 'Indonesia', 'Brazil', 'Pakistan',
       'Nigeria', 'Bangladesh', 'Russia', 'Mexico', 'Japan', 'Germany',
       'France', 'UK', 'Italy', 'Argentina', 'Algeria', 'Canada',
       'Australia', 'Kazakhstan'], dtype=object)

In [63]:
df_csv['COUNTRY'].isnull().sum()

0

In [64]:
import pandas as pd
import numpy as np
 
df = pd.DataFrame(np.random.randn(4,3),columns=['col1','col2','col3'])
print(df)
print('\n')
for key,value in df.iteritems():
   print(key,value)
   print('\n')

       col1      col2      col3
0 -1.033363  0.499841 -0.464745
1  0.042352 -2.631217  1.598911
2 -0.061298 -0.705507  1.459842
3 -0.236738 -1.251650  0.842611


col1 0   -1.033363
1    0.042352
2   -0.061298
3   -0.236738
Name: col1, dtype: float64


col2 0    0.499841
1   -2.631217
2   -0.705507
3   -1.251650
Name: col2, dtype: float64


col3 0   -0.464745
1    1.598911
2    1.459842
3    0.842611
Name: col3, dtype: float64

In [65]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(3,3),columns = ['col1','col2','col3'])
print(df)
print('\n')
for row in df.iterrows():
   print(row)
   print('\n')

       col1      col2      col3
0  0.416524 -0.506451 -0.132055
1  0.705417  1.630122 -0.603890
2 -0.190668  0.625543  0.923871


(0, col1    0.416524
col2   -0.506451
col3   -0.132055
Name: 0, dtype: float64)


(1, col1    0.705417
col2    1.630122
col3   -0.603890
Name: 1, dtype: float64)


(2, col1   -0.190668
col2    0.625543
col3    0.923871
Name: 2, dtype: float64)

In [ ]:
#pd.Series?

In [66]:
# Transpose
df.T

             0         1         2
col1  0.416524  0.705417 -0.190668
col2 -0.506451  1.630122  0.625543
col3 -0.132055 -0.603890  0.923871

### Get Dummies

In [67]:
import pandas as pd

data = {'firstname': ['Arun', 'Jebu', 'Venkat', 'Rekha', 'Majid','Mohsin'], 
        'lastname': ['Kumar', 'Jacob', 'Raghavan', 'Singh', 'Khan','Khan'], 
        'employmenttype': ['Service', 'Business', 'Student', 'Service', 'Business','Business'],
        'country' :['India','USA','USA','Sweden','Australia','Germany']}


df = pd.DataFrame(data, columns = ['firstname','lastname','employmenttype','country'])

print(df)

  firstname  lastname employmenttype    country
0      Arun     Kumar        Service      India
1      Jebu     Jacob       Business        USA
2    Venkat  Raghavan        Student        USA
3     Rekha     Singh        Service     Sweden
4     Majid      Khan       Business  Australia
5    Mohsin      Khan       Business    Germany

In [68]:
df1 = pd.get_dummies(df['employmenttype'])
df2 = pd.get_dummies(df['country'])
print(df1)
print(df2)

   Business  Service  Student
0         0        1        0
1         1        0        0
2         0        0        1
3         0        1        0
4         1        0        0
5         1        0        0
   Australia  Germany  India  Sweden  USA
0          0        0      1       0    0
1          0        0      0       0    1
2          0        0      0       0    1
3          0        0      0       1    0
4          1        0      0       0    0
5          0        1      0       0    0

In [ ]:
df

In [69]:
frames = [df,df1,df2]
result = pd.concat(frames,axis=1)
result

,firstname,lastname,employmenttype,country,Business,Service,Student,Australia,Germany,India,Sweden,USA
0,Arun,Kumar,Service,India,0,1,0,0,0,1,0,0
1,Jebu,Jacob,Business,USA,1,0,0,0,0,0,0,1
2,Venkat,Raghavan,Student,USA,0,0,1,0,0,0,0,1
3,Rekha,Singh,Service,Sweden,0,1,0,0,0,0,1,0
4,Majid,Khan,Business,Australia,1,0,0,1,0,0,0,0
5,Mohsin,Khan,Business,Germany,1,0,0,0,1,0,0,0

## concatination

In [70]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [71]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [72]:
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [73]:
# ignore index
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [74]:
# concatinate using keys
df = pd.concat([india_weather, us_weather], keys=["india", "us"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [ ]:
'''
Finding Relationships
A great aspect of the Pandas module is the corr() method.

The corr() method calculates the relationship between each column in your data set.
'''

In [75]:
df=pd.read_csv('data_panda.csv')
df.corr()

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.155408  0.009403  0.922717
Pulse    -0.155408  1.000000  0.786535  0.025121
Maxpulse  0.009403  0.786535  1.000000  0.203813
Calories  0.922717  0.025121  0.203813  1.000000

In [ ]:
'''
Perfect Correlation:
We can see that "Duration" and "Duration" got the number 1.000000, 
which makes sense, each column always has a perfect relationship with itself.

Good Correlation:
"Duration" and "Calories" got a 0.922721 correlation, which is a very good correlation, 
and we can predict that the longer you work out, the more calories you burn, and the other way around:
if you burned a lot of calories, you probably had a long work out.

Bad Correlation:
"Duration" and "Maxpulse" got a 0.009403 correlation, which is a very bad correlation, 
meaning that we can not predict the max pulse by just looking at the duration of the work out, and vice versa.

'''

In [76]:
import pandas as pd  
emp = {"Name": ["Parker", "Smith", "William", "Parker"],  
"Age": [21, 32, 29, 21]}  
info = pd.DataFrame(emp)  
print(info)
print("--------------------")
info = info.drop_duplicates()  
print(info)

      Name  Age
0   Parker   21
1    Smith   32
2  William   29
3   Parker   21
--------------------
      Name  Age
0   Parker   21
1    Smith   32
2  William   29

<h1>Apply<h1>

In [77]:
import pandas as pd
def calc_sum(kiran):
    return kiran+1
data = {
  "x": [50, 40, 30],
  "y": [300, 1112, 42]
}
df = pd.DataFrame(data)
print(df)
x = df.apply(calc_sum)
print(x)

    x     y
0  50   300
1  40  1112
2  30    42
    x     y
0  51   301
1  41  1113
2  31    43

In [ ]:
#explore sql joins
import pandas as pd
data1 = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30]
}

data2 = {
  "name": ["Sally", "Peter", "Micky"],
  "age": [77, 44, 22]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print(df2)
print("...........")
newdf = df1.merge(df2, how='right')
print(newdf)

In [ ]:
print(df1)
print(df2)

In [ ]:
df3=pd.merge(df1,df2,on="name",how="outer")
df3

In [ ]:
df3=pd.merge(df1,df2,on="name",how="left")
df3

In [ ]:
df3=pd.merge(df1,df2,on="name",how="right")
df3

In [ ]:
df3=pd.merge(df1,df2,on="name",how="inner")
df3